//---------------------------------------------------------------------------

#pragma hdrstop

//---------------------------------------------------------------------------
/*Недосекин Никита 51392 Вариант 21
Задание: "Вычислите произведение Р=2*4*6*8*...*2n для заданного n" */
#pragma argsused
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
int main(int argc, char* argv[])
{       int P=1, n, i;
        printf("Vvedite chislo N \n");
        scanf("%d", &n);
        for (i=1; i<=n; i++){
        P = P * 2 * i ; }
        printf("P=");
        printf("%d", P);
        getch();
        return 0;
}
//---------------------------------------------------------------------------




